driver-tests/bpelse/benchmark/PurchaseOrderService/src/purchaseOrder.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="purchaseOrder" targetNamespace="http://j2ee.netbeans.org/wsdl/purchaseOrder"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/purchaseOrder" xmlns:ns="http://xml.netbeans.org/schema/purchaseOrder" xmlns:plink="http://docs.oasis-open.org/wsbpel/2.0/plnktype">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/purchaseOrder">
            <xsd:import namespace="http://xml.netbeans.org/schema/purchaseOrder" schemaLocation="purchaseOrder.xsd"/>
        </xsd:schema>
    </types>
    <message name="purchaseOrderMsg">
        <part name="part1" element="ns:purchaseOrder"/>
    </message>
    <portType name="purchaseOrderPortType">
        <operation name="purchaseOrderOperation">
            <input name="input1" message="tns:purchaseOrderMsg"/>
            <output name="output1" message="tns:purchaseOrderMsg"/>
        </operation>
    </portType>
    <binding name="purchaseOrderBinding" type="tns:purchaseOrderPortType">
        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="purchaseOrderOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal"/>
            </input>
            <output name="output1">
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="purchaseOrderService">
        <port name="purchaseOrderPort" binding="tns:purchaseOrderBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/purchaseOrderService/purchaseOrderPort"/>
        </port>
    </service>
    <plink:partnerLinkType name="purchaseOrderPartner">
        <!-- partnerLinkType are automatically generated when a new portType is added. partnerLinkType are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plink:role name="purchaseOrderPortTypeRole" portType="tns:purchaseOrderPortType"/>
    </plink:partnerLinkType>
</definitions>
