driver-tests/bpelse/benchmark/purchaseOrderCoordinatorJBI/test/TestCase1/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:pur="http://xml.netbeans.org/schema/purchaseOrder" xmlns:ns1="http://xml.netbeans.org/schema/purchaseOrder">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <pur:purchaseOrder xmlns:pur="http://xml.netbeans.org/schema/purchaseOrder" orderDate="2006-11-07">
    <ns1:customer xmlns:ns1="http://xml.netbeans.org/schema/purchaseOrder">
      <ns1:name>John Doe</ns1:name>
      <ns1:address country="US">
        <ns1:name>John Doe</ns1:name>
        <ns1:street>123 Main street</ns1:street>
        <ns1:city>Monrovia</ns1:city>
        <ns1:state>CA</ns1:state>
        <ns1:zip>91016</ns1:zip>
      </ns1:address>
    </ns1:customer>
    <ns1:shipTo xmlns:ns1="http://xml.netbeans.org/schema/purchaseOrder" country="US">
      <ns1:name>John Doe</ns1:name>
      <ns1:street>123 Main street</ns1:street>
      <ns1:city>Arcadia</ns1:city>
      <ns1:state>CA</ns1:state>
      <ns1:zip>91007</ns1:zip>
    </ns1:shipTo>
    <ns1:billTo xmlns:ns1="http://xml.netbeans.org/schema/purchaseOrder" country="US">
      <ns1:name>John Doe</ns1:name>
      <ns1:street>123 Main street</ns1:street>
      <ns1:city>Duarte</ns1:city>
      <ns1:state>CA</ns1:state>
      <ns1:zip>91010</ns1:zip>
    </ns1:billTo>
    <ns1:status xmlns:ns1="http://xml.netbeans.org/schema/purchaseOrder">InProgress</ns1:status>
    <ns1:comment xmlns:ns1="http://xml.netbeans.org/schema/purchaseOrder">Order my books</ns1:comment>
    <ns1:lineItems xmlns:ns1="http://xml.netbeans.org/schema/purchaseOrder">
      <ns1:item partNum="123">
        <ns1:productName>Book1</ns1:productName>
        <ns1:quantity>1</ns1:quantity>
        <ns1:USPrice>50.00</ns1:USPrice>
        <ns1:comment>by Abc</ns1:comment>
        <ns1:shipDate>2006-12-02</ns1:shipDate>
      </ns1:item>
    </ns1:lineItems>
  </pur:purchaseOrder>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
